{
  "dataset": {
    "id": "qald-6-train-multilingual"
  },
  "questions": [
    {
      "id": "114",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all members of Prodigy.",
          "keywords": "member, Prodigy"
        },
        {
          "language": "fa",
          "string": "تمام اعضای پرادیجی را لیست کن.",
          "keywords": "اعضا، پرادیجی"
        },
        {
          "language": "de",
          "string": "Gib mir alle Bandmitglieder von Prodigy.",
          "keywords": "Bandmitglied, Prodigy"
        },
        {
          "language": "es",
          "string": "Dame todos los miembros de la banda Prodigy.",
          "keywords": "miembros de la banda Prodigy"
        },
        {
          "language": "it",
          "string": "Dammi tutti i membri dei Prodigy.",
          "keywords": "membri, Prodigy"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les membres de Prodigy.",
          "keywords": "members, Prodigy"
        },
        {
          "language": "nl",
          "string": "Noem alle leden van Prodigy.",
          "keywords": "leden, Prodigy"
        },
        {
          "language": "ro",
          "string": "Dă-mi toții membrii Prodigy.",
          "keywords": "membru, Prodigy"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> ?uri . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Liam_Howlett"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Maxim_(musician)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Keith_Flint"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "129",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all actors starring in movies directed by William Shatner.",
          "keywords": "actor, starring, movie, direct, William Shatner"
        },
        {
          "language": "fa",
          "string": "تمام بازیگرانی که در فیلم های کارگردانی شده توسط ویلیام شاتنر بازی کرده اند را لیست کن.",
          "keywords": "بازیگرانی، فیلم های، کارگردانی شده، ویلیام شاتنر، بازی کرده اند"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schauspieler von Filmen, in denen William Shatner Regie geführt hat.",
          "keywords": "Schauspieler, Film, Regie, William Shatner"
        },
        {
          "language": "es",
          "string": "Dame todos los actores de películas dirigidas por William Shatner.",
          "keywords": "actor, película, director, William Shatner"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli attori che recitano in film diretti da William Shatner.",
          "keywords": "attore, recitare, film, diretto, William Shatner"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les acteurs qui ont joué dans des films réalisés par Williams Shatner.",
          "keywords": "acteur, film, réalisé, William Shatner"
        },
        {
          "language": "nl",
          "string": "Geef alle acteurs van films waar William Shatner de regie van voerde.",
          "keywords": "acteur, film, regisseur, William Shatner"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți actorii care joacă roluri principale în filme regizate de William Shatner.",
          "keywords": "actor, rol principal, film, regiza, William Shatner"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?x <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/William_Shatner> .  ?x <http://dbpedia.org/ontology/starring> ?uri . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/J.T._Colosa"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Dan_Gauthier"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/John_Prosky"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Chuck_Williams_(actor)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Rickey_Medlocke"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/William_Shatner"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Tom_Towles"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Dan_Martin_(actor)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Duane_Whitaker"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Amy_Acker"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Dick_Van_Patten"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Brenda_Bakke"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "140",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "List all games by GMT.",
          "keywords": "game, GMT"
        },
        {
          "language": "fa",
          "string": "تمام بازی های جی.ام.تی را لیست کن.",
          "keywords": "بازی های، جی.ام.تی"
        },
        {
          "language": "de",
          "string": "Liste alle Spiele von GMT auf.",
          "keywords": "Spiel, GMT"
        },
        {
          "language": "es",
          "string": "Dame todos los juegos de GMT.",
          "keywords": "juegos, GMT"
        },
        {
          "language": "it",
          "string": "Elenca tutti i giochi di GMT.",
          "keywords": "gioco, GMT"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les jeux de GMT.",
          "keywords": "jeux, GMT"
        },
        {
          "language": "nl",
          "string": "Noem alle spelen van GMT.",
          "keywords": "spel, GMT"
        },
        {
          "language": "ro",
          "string": "Enumeră toate jocurile de GMT",
          "keywords": "joc, GMT"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Twilight_Struggle"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Sword_of_Rome"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Washington's_War"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Chandragupta_(board_game)"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "143",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all breeds of the German Shepherd dog.",
          "keywords": "breed, German Shepherd dog"
        },
        {
          "language": "fa",
          "string": "تمام گونه های سگ ژرمن شپرد را لیست کن.",
          "keywords": "گونه، سگ ژرمن شپرد"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schäferhundrassen.",
          "keywords": "Schäferhundrasse"
        },
        {
          "language": "es",
          "string": "Dame todas las razas de pastor alemán.",
          "keywords": "razas de pastor alemán"
        },
        {
          "language": "it",
          "string": "Dammi tutte le razze del pastore tedesco.",
          "keywords": "razza, pastore tedesco"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les races de bergers allemands.",
          "keywords": "races, bergers allemands"
        },
        {
          "language": "nl",
          "string": "Noem alle soorten Duitse herders.",
          "keywords": "Duitse herder, soort"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate rasele câinelui Ciobănesc German.",
          "keywords": "rasă, câine Ciobănesc German"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Mancs_(dog)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Lightning_(dog)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Lucky_(war_dog)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Rifleman_Khan"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Trakr"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Antis_(dog)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Appollo_(dog)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Crumstone_Irma"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Jet_of_Iada"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Nemo_A534"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Strongheart"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "164",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all launch pads operated by NASA.",
          "keywords": "launch pad, operate, NASA"
        },
        {
          "language": "fa",
          "string": "تمام سکوهای پرتاب راه اندازی شده توسط ناسا را لیست کن.",
          "keywords": "سکوهای پرتاب، راه اندازی شده، ناسا"
        },
        {
          "language": "de",
          "string": "Gib mir alle von der NASA betriebenen Startrampen.",
          "keywords": "Startrampe, betreiben, NASA"
        },
        {
          "language": "es",
          "string": "Dame todas las plataformas de lanzamiento operadas por la NASA.",
          "keywords": "plataforma de lanzamiento, operada por la NASA"
        },
        {
          "language": "it",
          "string": "Dammi tutte le rampe di lancio gestite dalla NASA.",
          "keywords": "rampa di lancio, gestire, NASA"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les rampes de lancements des Etats-unis.",
          "keywords": "rampes de lancements, Etats-unis"
        },
        {
          "language": "nl",
          "string": "Noem alle lanceerplatformen van de NASA.",
          "keywords": "lanceerplatform, NASA"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate rampele de lansare operate de către NASA.",
          "keywords": "rampă de lansare, operat, NASA"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad> .  ?uri <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Broglio_Space_Centre"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Keweenaw_Rocket_Range"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Spaceport_Florida_Launch_Complex_36"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_13"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "176",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "List the children of Margaret Thatcher.",
          "keywords": "Margaret Thatcher, child"
        },
        {
          "language": "fa",
          "string": "فرزندان مارگارت تاچر را لیست کن.",
          "keywords": "فرزندان، مارگارت تاچر"
        },
        {
          "language": "de",
          "string": "Liste die Kinder von Margaret Thatcher auf.",
          "keywords": "Margaret Thatcher, Kind"
        },
        {
          "language": "es",
          "string": "Dame una lista de los hijos de Margaret Thatcher.",
          "keywords": "Margaret Thatcher, hijos"
        },
        {
          "language": "it",
          "string": "Elenca i figli di Margaret Thatcher.",
          "keywords": "Margaret Thatcher, figlio"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les enfants de Margaret Thatcher.",
          "keywords": "enfants, Margaret Thatcher"
        },
        {
          "language": "nl",
          "string": "Noem alle kinderen van Margaret Thatcher.",
          "keywords": "kinderen, Margaret Thatcher"
        },
        {
          "language": "ro",
          "string": "Enumeră copiii lui Margaret Thatcher.",
          "keywords": "Margaret Thatcher, copil"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/child> ?uri . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Carol_Thatcher"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Mark_Thatcher"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "196",
      "answertype": "string",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all B-sides of the Ramones.",
          "keywords": "Ramones, B-sides"
        },
        {
          "language": "fa",
          "string": "تمام بیسایدهای رامونز را لیست کن.",
          "keywords": "بیسایدهای، رامونز"
        },
        {
          "language": "de",
          "string": "Gib mir alle B-Seiten der Ramones.",
          "keywords": "Ramones, B-Seiten"
        },
        {
          "language": "es",
          "string": "Dame todas las caras B de los Ramones.",
          "keywords": "Ramones, cara B"
        },
        {
          "language": "it",
          "string": "Dammi tutti i lati B dei Ramones.",
          "keywords": "Ramones, lato B"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les faces B des Ramones.",
          "keywords": "faces B, Ramones"
        },
        {
          "language": "nl",
          "string": "Geef alle B-kantjes van singles van de Ramones.",
          "keywords": "B-kant, single, de Ramones"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate laturile B ale Ramones",
          "keywords": "Ramones, laturi B"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?string WHERE {  ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> .  ?x <http://dbpedia.org/ontology/bSide> ?string . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "string"
            ]
          },
          "results": {
            "bindings": [
              {
                "string": {
                  "type": "literal",
                  "value": "\\\"No-One Could Ever Love You More\\\" (Norway)"
                }
              },
              {
                "string": {
                  "type": "literal",
                  "value": "\\\"Saturday Night Out\\\""
                }
              },
              {
                "string": {
                  "type": "literal",
                  "value": "\\\"Do You Wanna Dance?\\\""
                }
              },
              {
                "string": {
                  "type": "literal",
                  "value": "\\\"I Don't Care\\\""
                }
              },
              {
                "string": {
                  "type": "literal",
                  "value": "\\\"California Sun\\\" / \\\"I Dont Wanna Walk Around With You\\\" (live)"
                }
              },
              {
                "string": {
                  "type": "literal",
                  "value": "\\\"Gee Girl\\\""
                }
              },
              {
                "string": {
                  "type": "literal",
                  "value": "\\\"Babysitter\\\""
                }
              },
              {
                "string": {
                  "type": "literal",
                  "value": "\\\"Daytime Dilemma (Dangers of Love)\\\""
                }
              },
              {
                "string": {
                  "type": "literal",
                  "value": "\\\"Go Home Ann\\\" (12\\\" only)"
                }
              },
              {
                "string": {
                  "type": "literal",
                  "value": "\\\"She's the One\\\""
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "28",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all communist countries.",
          "keywords": "communist countries"
        },
        {
          "language": "fa",
          "string": "تمام کشورهای کمونیست را لیست کن.",
          "keywords": "کشورهای، کمونیست"
        },
        {
          "language": "de",
          "string": "Gib mir alle kommunistischen Länder.",
          "keywords": "kommunistische Länder"
        },
        {
          "language": "es",
          "string": "Dame todos los países comunistas.",
          "keywords": "países comunistas"
        },
        {
          "language": "it",
          "string": "Dammi tutti i paesi comunisti.",
          "keywords": "paesi comunisti"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les pays communistes.",
          "keywords": "pays communistes"
        },
        {
          "language": "nl",
          "string": "Geef alle communistische landen.",
          "keywords": "communistische landen"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate țările comuniste.",
          "keywords": "țări comuniste"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/property/ideology> <http://dbpedia.org/resource/Communism> . }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Viet_Cong"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "51",
      "answertype": "resource",
      "aggregation": "true",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all libraries established earlier than 1400.",
          "keywords": "libraries, established, earlier than 1400"
        },
        {
          "language": "fa",
          "string": "تمام کتاب خانه هایی که قبل از 1400 تأسیس شدند را لیست کن.",
          "keywords": "کتاب خانه هایی، قبل از 1400، تأسیس"
        },
        {
          "language": "de",
          "string": "Gib mir alle Bibliotheken, die vor 1400 gegründet worden.",
          "keywords": "Bibliotheken, gegründet, vor 1400"
        },
        {
          "language": "es",
          "string": "Dame todas las bibliotecas que fueron establecidas antes de 1400.",
          "keywords": "bibliotecas, establecidas, antes de 1400"
        },
        {
          "language": "it",
          "string": "Dammi tutte le biblioteche fondate prima del 1400.",
          "keywords": "biblioteche, fondate, prima del 1400"
        },
        {
          "language": "fr",
          "string": "Donnes-moi toutes les bibliothèques établies avant 1400.",
          "keywords": "bibliothèques, établies, avant 1400"
        },
        {
          "language": "nl",
          "string": "Geef me alle bibliotheken die voor 1400 werden opgericht.",
          "keywords": "bibliotheken, opgericht, voor 1400"
        },
        {
          "language": "ro",
          "string": "Dă-mi tote bibliotecile înființate înainte de 1400",
          "keywords": "biblioteci, înființat, înainte de 1400"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library> .  ?uri <http://dbpedia.org/property/established> ?year .  FILTER (?year < 1400) } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Austrian_National_Library"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/National_and_University_Library_of_the_Republika_Srpska"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Merton_College_Library"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Maughan_Library"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Heidelberg_University_Library"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Jagiellonian_Library"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Mother_Irene_Gill_Memorial_Library"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Cambridge_University_Library"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Library_of_Ashurbanipal"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "57",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "List all episodes of the first season of the HBO television series The Sopranos.",
          "keywords": "HBO, television series, Sopranos, first season, episode"
        },
        {
          "language": "fa",
          "string": "تمام قسمت های فصل اول سریال تلویزیونی سوپرانوز متعلق به اچ.بی.او را لیست کن.",
          "keywords": "قسمت های، فصل اول، سریال تلویزیونی، سوپرانوز، اچ.بی.او"
        },
        {
          "language": "de",
          "string": "Liste alle Episoden der ersten Staffel der HBO-Fernsehserie Die Sopranos auf.",
          "keywords": "HBO-Fernsehserie, Sopranos, erste Staffel, Episode"
        },
        {
          "language": "es",
          "string": "Dame todos los episodios de la prímera época de la serie de HBO Los Sporanos.",
          "keywords": "serie televisiva de HBO, Los Sopranos, primera época, episodios"
        },
        {
          "language": "it",
          "string": "Elenca tutti gli episodi della prima stagione della serie televisiva di HBO i Sopranos.",
          "keywords": "serie televisiva di HBO, i Sopranos, prima stagione, episodio"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les épisodes de la première saison de la série télévisée de HBO les Sopranos.",
          "keywords": "épisodes de la première saison, HBO, les Sopranos"
        },
        {
          "language": "nl",
          "string": "Noem alle afleveringen van het eerste seizoen van de HBO-serie The Sopranos.",
          "keywords": "HBO-serie, The Sopranos, eerste seizoen, aflevering"
        },
        {
          "language": "ro",
          "string": "Listează toate episodele din primul sezon al serialului HBO de televiziune The Sopranos",
          "keywords": "HBO, serial de televiziune, Sopranos, primul sezon, episod"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/The_Sopranos> .  ?uri <http://dbpedia.org/ontology/seasonNumber> 1 . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Denial,_Anger,_Acceptance"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/The_Legend_of_Tennessee_Moltisanti"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/A_Hit_Is_a_Hit"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Boca_(The_Sopranos)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/46_Long"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/I_Dream_of_Jeannie_Cusamano"
                }
              }
            ]
          }
        }
      ]
    }
  ]
}
