<?xml version="1.0" ?>
<dataset id="qald-4_multilingual_train">

<question id="10" onlydbo="true" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[In which country does the Nile start?]]></string>
<string lang="de"><![CDATA[In welchem Land entspringt der Nil?]]></string>
<string lang="es"><![CDATA[¿En qué país nace el Nilo?]]></string>
<string lang="it"><![CDATA[In quale stato nasce il Nilo?]]></string>
<string lang="fr"><![CDATA[Dans quel pays commence le Nil?]]></string>
<string lang="nl"><![CDATA[In welk land ontspringt de Nijl?]]></string>
<string lang="ro"><![CDATA[Din ce țară izvorăște Nilul?]]></string>
<keywords lang="en"><![CDATA[Nile, start, country]]></keywords>
<keywords lang="de"><![CDATA[Nil, entspringen, Land]]></keywords>
<keywords lang="es"><![CDATA[Nilo, país, orígen]]></keywords>
<keywords lang="it"><![CDATA[Nilo, stato, origine]]></keywords>
<keywords lang="fr"><![CDATA[pays, commence, Nil]]></keywords>
<keywords lang="nl"><![CDATA[ontspringt, Nijl]]></keywords>
<keywords lang="ro"><![CDATA[Nil, izvor, țară]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        res:Nile dbo:sourceCountry ?uri . 
} ]]>
</query>
</question>

<question id="112" onlydbo="false" answertype="resource" aggregation="true">
<string lang="en"><![CDATA[Give me all world heritage sites designated within the past two years.]]></string>
<string lang="de"><![CDATA[Gib mir alle Welterbestätten, die in den vergangenen zwei Jahren aufgenommen wurden.]]></string>
<string lang="es"><![CDATA[¿Qué patrimonios de la humanidad fueron reconocidos en los últimos dos años?]]></string>
<string lang="it"><![CDATA[Dammi tutti i siti designati patrimoni dell'umanità negli ultimi due anni.]]></string>
<string lang="fr"><![CDATA[Donne-moi tous les patrimoines mondiaux qui ont été inscrits pendant les derniers deux ans.]]></string>
<string lang="nl"><![CDATA[Noem alle plaatsen op de Werelderfgoedlijst die in de laatste twee jaar zijn toegevoegd.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate siturile de patrimoniu mondial desemnate in ultimii doi ani.]]></string>
<keywords lang="en"><![CDATA[world heritage site, designate, past two years]]></keywords>
<keywords lang="de"><![CDATA[Welterbestätte, aufnehmen, vergangene zwei Jahre]]></keywords>
<keywords lang="es"><![CDATA[patrimonios de la humanidad, reconocidos, últimos dos años]]></keywords>
<keywords lang="it"><![CDATA[patrimoni dell'umanità, designare, ultimi due anni]]></keywords>
<keywords lang="fr"><![CDATA[patrimoines mondiaux, inscrits, derniers deux ans]]></keywords>
<keywords lang="nl"><![CDATA[Werelderfgoed, laatste twee jaar, toevoegen]]></keywords>
<keywords lang="ro"><![CDATA[situri de patrimoniu mondial, desemna, ultimii doi ani]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX dbp: <http://dbpedia.org/property/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:WorldHeritageSite . 
        ?uri dbp:year ?x . 
        FILTER ( ?x >= '2012'^^xsd:integer) 
} ]]>
</query>
</question>

<question id="116" onlydbo="true" answertype="boolean" aggregation="true">
<string lang="en"><![CDATA[Does Breaking Bad have more episodes than Game of Thrones?]]></string>
<string lang="de"><![CDATA[Hat Breaking Bad mehr Episoden als Game of Thrones?]]></string>
<string lang="es"><![CDATA[¿Tiene Breaking Bad más episodios que Game of Thrones?]]></string>
<string lang="it"><![CDATA[Breaking Bad ha più episodi di Game of Thrones?]]></string>
<string lang="fr"><![CDATA[A Breaking Bad plus d'épisodes que Game of Thrones?]]></string>
<string lang="nl"><![CDATA[Heeft Breaking Bad meer afleveringen dan Game of Thrones?]]></string>
<string lang="ro"><![CDATA[Are Breaking Bad mai multe episoade decât Game of Thrones?]]></string>
<keywords lang="en"><![CDATA[Breaking Bad, episodes, more than, Game of Thrones]]></keywords>
<keywords lang="de"><![CDATA[Breaking Bad, Episoden, mehr als, Game of Thrones]]></keywords>
<keywords lang="es"><![CDATA[Breaking Bad, episodios, más que, Game of Thrones]]></keywords>
<keywords lang="it"><![CDATA[Breaking Bad, eposido, più di, Game of Thrones]]></keywords>
<keywords lang="fr"><![CDATA[Breaking Bad, épisodes plus que, Game of Thrones]]></keywords>
<keywords lang="nl"><![CDATA[Breaking Bad, afleveringen, meer dan, Game of Thrones]]></keywords>
<keywords lang="ro"><![CDATA[Breaking Bad, episoade, mai multe decât, Game of Thrones]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
ASK 
WHERE { 
        res:Breaking_Bad dbo:numberOfEpisodes ?x . 
        res:Game_of_Thrones dbo:numberOfEpisodes ?y . 
        FILTER (?y > ?x) 
} ]]>
</query>
</question>

<question id="146" onlydbo="true" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[Which professional surfers were born in Australia?]]></string>
<string lang="de"><![CDATA[Welche Profisurfer wurden in Australien geboren?]]></string>
<string lang="es"><![CDATA[¿Qué surfistas profesionales nacieron en Australia?]]></string>
<string lang="it"><![CDATA[Quali surfisti professionisti sono nati in Australia?]]></string>
<string lang="fr"><![CDATA[Quels surfeurs professionels sont nés en Australie?]]></string>
<string lang="nl"><![CDATA[Welke professionele surfers werden geboren in Australië?]]></string>
<string lang="ro"><![CDATA[Ce surferi profesioniști s-au născut în Australia?]]></string>
<keywords lang="en"><![CDATA[professional surfer, born, Australia]]></keywords>
<keywords lang="de"><![CDATA[Profisurfer, geboren, Australien]]></keywords>
<keywords lang="es"><![CDATA[surfista profesional, nacido, Australia]]></keywords>
<keywords lang="it"><![CDATA[surfista professionista, nato, Australia]]></keywords>
<keywords lang="fr"><![CDATA[surfeurs professionels, Australie]]></keywords>
<keywords lang="nl"><![CDATA[professionele surfer, Australië]]></keywords>
<keywords lang="ro"><![CDATA[surfer profesionist, născut, Australia]]></keywords>
<query><![CDATA[ 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX res: <http://dbpedia.org/resource/> 
SELECT DISTINCT ?uri 
WHERE { 
        ?uri dbo:occupation res:Surfing .  
        ?uri dbo:birthPlace res:Australia . 
} ]]>
</query>
</question>

<question id="148" onlydbo="true" answertype="resource" aggregation="false">
<string lang="en"><![CDATA[In which UK city are the headquarters of the MI6?]]></string>
<string lang="de"><![CDATA[In welcher Stadt im Vereinigten Königreich ist das Hauptquartier des MI6?]]></string>
<string lang="es"><![CDATA[¿En qué ciudad del reino unido se encuentra el cuartel genetal del MI6?]]></string>
<string lang="it"><![CDATA[In quale città del Regno Unito si trova il quartier generale del MI6?]]></string>
<string lang="fr"><![CDATA[Dans quelle ville anglaise se trouvent les quartiers genéraux du MI6?]]></string>
<string lang="nl"><![CDATA[In welke Britse stad is het hoofdkwartier van MI6 gevestigd?]]></string>
<string lang="ro"><![CDATA[În care oraș din Regatul Unit se află cartierul general al MI6?]]></string>
<keywords lang="en"><![CDATA[MI6, headquarters, city, UK]]></keywords>
<keywords lang="de"><![CDATA[MI6, Hauptquartier, Stadt, Vereinigtes Königreich]]></keywords>
<keywords lang="es"><![CDATA[MI6, cuartel general, ciudad, reino unido]]></keywords>
<keywords lang="it"><![CDATA[MI6, quartier generale, città, Regno Unito]]></keywords>
<keywords lang="fr"><![CDATA[ville anglaise, quartiers genéraux, MI6]]></keywords>
<keywords lang="nl"><![CDATA[MI6, hoofdkwartier, Britse stad]]></keywords>
<keywords lang="ro"><![CDATA[MI6, cartier general, oraș, Regatul Unit]]></keywords>
<query><![CDATA[ 
PREFIX res: <http://dbpedia.org/resource/> 
PREFIX dbo: <http://dbpedia.org/ontology/> 
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri 
WHERE { 
        ?uri rdf:type dbo:City . 
        res:Secret_Intelligence_Service dbo:headquarter ?uri . 
} ]]>
</query>
</question>

<question aggregation="true" answertype="resource" id="193" onlydbo="false">
<string lang="en"><![CDATA[Which movies did Kurosawa direct after Rashomon?]]></string>
<string lang="de"><![CDATA[Welche Filme hat Kurosawa nach Rashomon gedreht?]]></string>
<string lang="es"><![CDATA[¿Qué películas ha rodado Kurosawa después de Rashomon?]]></string>
<string lang="it"><![CDATA[Che film ha diretto Kurosawa dopo Rashomon?]]></string>
<string lang="fr"><![CDATA[Quels films ont été realisés par Kurosawa après Rashomon?]]></string>
<string lang="nl"><![CDATA[Welke films heeft Kurosawa geregisseerd na Rashomon?]]></string>
<string lang="ro"><![CDATA[Ce filme a regizat Kurosawa după Rashomon?]]></string>
<keywords lang="en"><![CDATA[film, direct, Kurosawa, after, Rashomon]]></keywords>
<keywords lang="de"><![CDATA[Film, drehen, Kurosawa, nach, Rashomon]]></keywords>
<keywords lang="es"><![CDATA[película, rodada, Kurosawa, después de Rashomon?]]></keywords>
<keywords lang="it"><![CDATA[film, dirigere, Kurosawa, dopo Rashomon]]></keywords>
<keywords lang="fr"><![CDATA[films, Kurosawa, après Rashomon]]></keywords>
<keywords lang="nl"><![CDATA[film, Kurosawa, regisseur, na Rashomon]]></keywords>
<keywords lang="ro"><![CDATA[film, regiza, Kurosawa, după, Rashomon]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:Film .
        ?uri dbo:director res:Akira_Kurosawa .
      { ?uri dbo:releaseDate ?x . } 
      UNION 
      { ?uri dbp:released ?x . }
        res:Rashomon dbo:releaseDate ?y .
        FILTER (?y > ?x)
}
]]></query>
</question>

<question aggregation="false" answertype="resource" id="23" onlydbo="true">
<string lang="en"><![CDATA[Which television shows were created by Walt Disney?]]></string>
<string lang="de"><![CDATA[Welche Fernsehserien hat Walt Disney entworfen?]]></string>
<string lang="es"><![CDATA[¿Qué series televisivas ideó Walt Disney?]]></string>
<string lang="it"><![CDATA[Quali serie televisive sono state create dalla Walt Disney?]]></string>
<string lang="fr"><![CDATA[Quelles séries télevisées ont été créées par Walt Disney?]]></string>
<string lang="nl"><![CDATA[Welke televisieseries werden bedacht door Walt Disney?]]></string>
<string lang="ro"><![CDATA[Ce seriale de televiziune au fost create de Walt Disney?]]></string>
<keywords lang="en"><![CDATA[television show, create, Walt Disney]]></keywords>
<keywords lang="de"><![CDATA[Fernsehserie, entwerfen, Walt Disney]]></keywords>
<keywords lang="es"><![CDATA[serie televisica, ideó, Walt Disney]]></keywords>
<keywords lang="it"><![CDATA[serie televisiva, ideata, Walt Disney?]]></keywords>
<keywords lang="fr"><![CDATA[séries télevisées, créées, Walt Disney]]></keywords>
<keywords lang="nl"><![CDATA[televisieserie, bedacht, Walt Disney]]></keywords>
<keywords lang="ro"><![CDATA[serial de televiziune, creat, Walt Disney]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
        ?uri rdf:type dbo:TelevisionShow .
        ?uri dbo:creator res:Walt_Disney .
}
]]></query>
</question>

<question aggregation="false" answertype="resource" id="29" onlydbo="false">
<string lang="en"><![CDATA[Which awards did WikiLeaks win?]]></string>
<string lang="de"><![CDATA[Welche Preise hat WikiLeaks gewonnen?]]></string>
<string lang="es"><![CDATA[¿Qué premios ha ganado WikiLeaks?]]></string>
<string lang="it"><![CDATA[Quali premi ha vinto WikiLeaks?]]></string>
<string lang="fr"><![CDATA[Quels prix ont été gagnés par Wikileaks?]]></string>
<string lang="nl"><![CDATA[Welke prijzen heeft WikiLeaks gewonnen?]]></string>
<string lang="ro"><![CDATA[Ce premii a câștigat WikiLeaks?]]></string>
<keywords lang="en"><![CDATA[WikiLeaks, award]]></keywords>
<keywords lang="de"><![CDATA[WikiLeaks, Preise]]></keywords>
<keywords lang="es"><![CDATA[Wikileaks, premios]]></keywords>
<keywords lang="it"><![CDATA[WikiLeaks, premio]]></keywords>
<keywords lang="fr"><![CDATA[prix, WikiLeaks]]></keywords>
<keywords lang="nl"><![CDATA[prijs, Wikileaks]]></keywords>
<keywords lang="ro"><![CDATA[WikiLeaks, premii]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri
WHERE {
        res:WikiLeaks dbp:awards ?uri .
}
]]></query>
</question>

<question aggregation="false" answertype="resource" id="3" onlydbo="true">
<string lang="en"><![CDATA[Who is the daughter of Ingrid Bergman married to?]]></string>
<string lang="de"><![CDATA[Mit wem ist die Tochter von Ingrid Bergman verheiratet?]]></string>
<string lang="es"><![CDATA[¿Con quién está casada la hija de Ingrid Bergman?]]></string>
<string lang="it"><![CDATA[Con chi è sposata la figlia di Ingrid Bergman?]]></string>
<string lang="fr"><![CDATA[Qui est l'épou de la fille d'Ingrid Bergman?]]></string>
<string lang="nl"><![CDATA[Met wie is de dochter van Ingrid Bergman getrouwd?]]></string>
<string lang="ro"><![CDATA[Cu cine este căsătorită fiica lui Ingrid Bergman?]]></string>
<keywords lang="en"><![CDATA[Ingrid Bergman, daughter, married]]></keywords>
<keywords lang="de"><![CDATA[Ingrid Bergman, Tochter, verheiratet]]></keywords>
<keywords lang="es"><![CDATA[Ingrid Bergman, hija, casada]]></keywords>
<keywords lang="it"><![CDATA[Ingrid Bergman, figlia, sposata]]></keywords>
<keywords lang="fr"><![CDATA[épou, fille, Ingrid Bergman]]></keywords>
<keywords lang="nl"><![CDATA[Ingrid Bergman, dochter, getrouwd]]></keywords>
<keywords lang="ro"><![CDATA[Ingrid Bergman, fiică, căsătorită]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Ingrid_Bergman dbo:child ?child .
        ?child dbo:spouse ?uri .
}
]]></query>
</question>

<question aggregation="false" answertype="resource" id="35" onlydbo="true">
<string lang="en"><![CDATA[Who is the owner of Universal Studios?]]></string>
<string lang="de"><![CDATA[Wem gehören die Universal Studios?]]></string>
<string lang="es"><![CDATA[¿A quién le pertenecen los Universal Studios?]]></string>
<string lang="it"><![CDATA[Chi è il proprietario degli Universal Studios?]]></string>
<string lang="fr"><![CDATA[A qui appartient Universal Studios?]]></string>
<string lang="nl"><![CDATA[Wie is de eigenaar van Universal Studios?]]></string>
<string lang="ro"><![CDATA[Cine este proprietarul Universal Studios?]]></string>
<keywords lang="en"><![CDATA[Universal Studios, owner]]></keywords>
<keywords lang="de"><![CDATA[Universal Studios, gehören]]></keywords>
<keywords lang="es"><![CDATA[Universal Studios, dueño]]></keywords>
<keywords lang="it"><![CDATA[Universal Studios, proprietario]]></keywords>
<keywords lang="fr"><![CDATA[appartient, Universal Studios]]></keywords>
<keywords lang="nl"><![CDATA[eigenaar, Universal Studios]]></keywords>
<keywords lang="ro"><![CDATA[Universal Studios, proprietar]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        res:Universal_Studios dbo:owner ?uri .
}
]]></query>
</question>

<question aggregation="false" answertype="resource" id="36" onlydbo="true">
<string lang="en"><![CDATA[Through which countries does the Yenisei river flow?]]></string>
<string lang="de"><![CDATA[Durch welche Länder fließt der Yenisei?]]></string>
<string lang="es"><![CDATA[¿Por qué países fluye el río Yenisei?]]></string>
<string lang="it"><![CDATA[Attraverso quali stati scorre il fiume Yenisei?]]></string>
<string lang="fr"><![CDATA[Quels sont les pays traversés par l'Ienisseï?]]></string>
<string lang="nl"><![CDATA[Door welke landen stroomt de Jenisej?]]></string>
<string lang="ro"><![CDATA[Ce țări traversează fluviul Enisei?]]></string>
<keywords lang="en"><![CDATA[Yenisei river, flow through, country]]></keywords>
<keywords lang="de"><![CDATA[Yenisei, fließen, Land]]></keywords>
<keywords lang="es"><![CDATA[países, fluye, río Yenisei]]></keywords>
<keywords lang="it"><![CDATA[fiume Yenisei, scorrere attraverso, stato]]></keywords>
<keywords lang="fr"><![CDATA[Ienisseï, pays traversés]]></keywords>
<keywords lang="nl"><![CDATA[Jenisej, land, stroomt door]]></keywords>
<keywords lang="ro"><![CDATA[fluviul Enisei, traversează, țară]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri 
WHERE {
        res:Yenisei_River dbo:country ?uri .
}
]]></query>
</question>

<question aggregation="false" answertype="resource" id="44" onlydbo="false">
<string lang="en"><![CDATA[Who designed the Brooklyn Bridge?]]></string>
<string lang="de"><![CDATA[Wer hat die Brooklyn Bridge entworfen?]]></string>
<string lang="es"><![CDATA[¿Quién diseñó la Brooklyn Bridge?]]></string>
<string lang="it"><![CDATA[Chi ha progettato il ponte di Brooklyn?]]></string>
<string lang="fr"><![CDATA[Qui a conçu le pont de Brooklyn?]]></string>
<string lang="nl"><![CDATA[Wie ontwierp de Brooklyn Bridge?]]></string>
<string lang="ro"><![CDATA[Cine a proiectat podul din Brooklyn?]]></string>
<keywords lang="en"><![CDATA[Brooklyn Bridge, design]]></keywords>
<keywords lang="de"><![CDATA[Brooklyn Bridge, entwerfen]]></keywords>
<keywords lang="es"><![CDATA[diseñador, Brooklyn Bridge]]></keywords>
<keywords lang="it"><![CDATA[ponte di Brooklyn, progettare]]></keywords>
<keywords lang="fr"><![CDATA[pont de Brooklyn, conçu]]></keywords>
<keywords lang="nl"><![CDATA[ontwerp, Brooklyn Bridge]]></keywords>
<keywords lang="ro"><![CDATA[podul din Brooklyn, proiecta]]></keywords>
<query><![CDATA[
PREFIX res: <http://dbpedia.org/resource/>
PREFIX dbp: <http://dbpedia.org/property/>
SELECT DISTINCT ?uri 
WHERE {
        res:Brooklyn_Bridge dbp:designer ?uri .
}
]]></query>
</question>

<question aggregation="false" answertype="resource" id="47" onlydbo="true">
<string lang="en"><![CDATA[What is the highest place of the Urals?]]></string>
<string lang="de"><![CDATA[Was ist die höhchste Stelle des Ural?]]></string>
<string lang="es"><![CDATA[¿Cuál es el punto más alto del montes Urales?]]></string>
<string lang="it"><![CDATA[Qual è il punto più alto del Uràli?]]></string>
<string lang="fr"><![CDATA[Quel est l'endroit le plus haut d'Oural?]]></string>
<string lang="nl"><![CDATA[Wat is het hoogste punt van de Oeral?]]></string>
<string lang="ro"><![CDATA[Care este cel mai înalt punct de pe munții Urali?]]></string>
<keywords lang="en"><![CDATA[Urals, highest place]]></keywords>
<keywords lang="de"><![CDATA[Ural, höchste Stelle]]></keywords>
<keywords lang="es"><![CDATA[los montes Urales, punto más alto]]></keywords>
<keywords lang="it"><![CDATA[Uràli, punto più alto]]></keywords>
<keywords lang="fr"><![CDATA[l'Oural, endroit le plus haut]]></keywords>
<keywords lang="nl"><![CDATA[Oeral, hoogste punt]]></keywords>
<keywords lang="ro"><![CDATA[munții Urali, cel mai înalt punct]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {       
        res:Ural_Mountains dbo:highestPlace ?uri .  
}
]]></query>
</question>

<question aggregation="false" answertype="resource" id="49" onlydbo="false">
<string lang="en"><![CDATA[Give me all companies in the advertising industry.]]></string>
<string lang="de"><![CDATA[Gib mir alle Unternehmen, die in der Werbebranche tätig sind.]]></string>
<string lang="es"><![CDATA[Dame todas las empresas publicitarias.]]></string>
<string lang="it"><![CDATA[Dammi tutte le aziende pubblicitarie.]]></string>
<string lang="fr"><![CDATA[Donnes-moi toutes les agences de publicité.]]></string>
<string lang="nl"><![CDATA[Noem alle bedrijven die in de reclamebranche actief zijn.]]></string>
<string lang="ro"><![CDATA[Dă-mi toate companiile din industria publicitară.]]></string>
<keywords lang="en"><![CDATA[company, advertising industry]]></keywords>
<keywords lang="de"><![CDATA[Unternehmen, Werbebranche]]></keywords>
<keywords lang="es"><![CDATA[empresas publicitarias]]></keywords>
<keywords lang="it"><![CDATA[aziende pubblicitarie]]></keywords>
<keywords lang="fr"><![CDATA[agences de publicité]]></keywords>
<keywords lang="nl"><![CDATA[bedrijf, reclamebranche]]></keywords>
<keywords lang="ro"><![CDATA[companii, industria publicitară]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT COUNT(DISTINCT ?uri)
WHERE { 
        ?uri rdf:type dbo:Company  .
        ?uri dbp:industry ?industry . 
        FILTER regex(?industry,'advertising','i') . 
}
]]></query>
</question>

<question aggregation="false" answertype="resource" id="53" onlydbo="true">
<string lang="en"><![CDATA[Give me all federal chancellors of Germany.]]></string>
<string lang="de"><![CDATA[Gib mir alle Bundeskanzler.]]></string>
<string lang="es"><![CDATA[Dame todos los cancilleres alemanos.]]></string>
<string lang="it"><![CDATA[Dammi tutti i cancellieri tedeschi.]]></string>
<string lang="fr"><![CDATA[Donnes-moi tous les chancelièrs allemands.]]></string>
<string lang="nl"><![CDATA[Noem alle Duitse bondskanseliers.]]></string>
<string lang="ro"><![CDATA[Dă-mi toți cancelarii federali ai Germaniei]]></string>
<keywords lang="en"><![CDATA[Germany, federal chancellors]]></keywords>
<keywords lang="de"><![CDATA[Bundeskanzler]]></keywords>
<keywords lang="es"><![CDATA[cancilleres, alemanos]]></keywords>
<keywords lang="it"><![CDATA[cancellieri, tedeschi]]></keywords>
<keywords lang="fr"><![CDATA[chanceliers, allemands]]></keywords>
<keywords lang="nl"><![CDATA[Duits, bondskanseliers]]></keywords>
<keywords lang="ro"><![CDATA[Germania, cancelar federal]]></keywords>
<query><![CDATA[
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {
        ?uri dbp:office res:Chancellor_of_Germany . 
}
]]></query>
</question>

<question aggregation="false" answertype="resource" id="64" onlydbo="false">
<string lang="en"><![CDATA[Which software has been developed by organizations founded in California?]]></string>
<string lang="de"><![CDATA[Welche Softwareprodukte wurde von Unternehmen entwickelt, die in Kalifornien gegründet wurden?]]></string>
<string lang="es"><![CDATA[¿Qué productos de software han sido desarrollados por empresas fundadas en California?]]></string>
<string lang="it"><![CDATA[Quali software sono stati sviluppati da aziende fondate in California?]]></string>
<string lang="fr"><![CDATA[Quels logiciels ont été dévelopés par des agences fondées en Californie?]]></string>
<string lang="nl"><![CDATA[Welke software is ontwikkeld door bedrijven opgericht in Californië?]]></string>
<string lang="ro"><![CDATA[Ce software a fost dezvoltat de organizații fondate în California]]></string>
<keywords lang="en"><![CDATA[organization, founded, California, develop, software]]></keywords>
<keywords lang="de"><![CDATA[Unternehmen, gründen, Kalifornien, entwickeln, Softwareprodukt]]></keywords>
<keywords lang="es"><![CDATA[empresas, fundadas, California, desarrolar, productos de software]]></keywords>
<keywords lang="it"><![CDATA[azienda, fondata, California, sviluppare, software]]></keywords>
<keywords lang="fr"><![CDATA[Californie, agences, fondées, logiciels]]></keywords>
<keywords lang="nl"><![CDATA[bedrijf, opgericht, Californië, ontwikkeld, software]]></keywords>
<keywords lang="ro"><![CDATA[organizație, fondată, California, dezvolta, software]]></keywords>
<query><![CDATA[
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri
WHERE {         
        ?uri rdf:type dbo:Software .
        ?company rdf:type dbo:Company .
        ?uri dbo:developer ?company . 
        { ?company dbo:foundationPlace res:California . }
        UNION
        { ?company dbp:foundation res:California . }     
}
]]></query>
</question>

<question aggregation="false" answertype="boolean" id="7" onlydbo="true">
<string lang="en"><![CDATA[Is the wife of president Obama called Michelle?]]></string>
<string lang="de"><![CDATA[Heißt die Frau von Präsident Obama Michelle?]]></string>
<string lang="es"><![CDATA[¿La mujer del presidente Obama se llama Michelle?]]></string>
<string lang="it"><![CDATA[La moglie del presidente Obama si chiama Michelle?]]></string>
<string lang="fr"><![CDATA[L'épouse du président Obama s'appelle-t-elle Michelle?]]></string>
<string lang="nl"><![CDATA[Heet de echtgenote van president Barack Obama Michelle?]]></string>
<string lang="ro"><![CDATA[Este soția președintelui Obama numită Michelle?]]></string>
<keywords lang="en"><![CDATA[Obama, president, wife, called, Michelle]]></keywords>
<keywords lang="de"><![CDATA[Obama, Präsident, Frau, heißen, Michelle]]></keywords>
<keywords lang="es"><![CDATA[mujer, presidente, Obama, se lamma, Michelle]]></keywords>
<keywords lang="it"><![CDATA[moglie, presidente, Obama, si chiama, Michelle]]></keywords>
<keywords lang="fr"><![CDATA[épouse, Obama, Michelle, appelle]]></keywords>
<keywords lang="nl"><![CDATA[echtgenote, Barack Obama, Michelle]]></keywords>
<keywords lang="ro"><![CDATA[Obama, președinte, soție, numită, Michelle]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
ASK 
WHERE {
        res:Barack_Obama dbo:spouse ?spouse .
        ?spouse rdfs:label ?name .
        FILTER(regex(?name,'Michelle')) 
}
]]></query>
</question>

<question aggregation="false" answertype="resource" id="75" onlydbo="true">
<string lang="en"><![CDATA[Who was the first president of the United States?]]></string>
<string lang="de"><![CDATA[Wer war der erste Präsident der Vereinigten Staaten?]]></string>
<string lang="es"><![CDATA[¿Quién era el primer presidente de los Estados Unidos?]]></string>
<string lang="it"><![CDATA[Chi è stato il primo presidente degli Stati Uniti?]]></string>
<string lang="fr"><![CDATA[Qui était le premier président des États-Unis?]]></string>
<string lang="nl"><![CDATA[Wie was de eerste president van de Verenigde Staten?]]></string>
<string lang="ro"><![CDATA[Cine a fost primul președinte ale Statelor Unite?]]></string>
<keywords lang="en"><![CDATA[United States, first president]]></keywords>
<keywords lang="de"><![CDATA[Vereinigte Staaten, erster Präsident]]></keywords>
<keywords lang="es"><![CDATA[estados unidos, primer presidente]]></keywords>
<keywords lang="it"><![CDATA[Stati Uniti, primo presidente]]></keywords>
<keywords lang="fr"><![CDATA[Etats-Unis, premier président]]></keywords>
<keywords lang="nl"><![CDATA[Verenigde Staten, eerste president]]></keywords>
<keywords lang="ro"><![CDATA[Statele Unite, primul președinte]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
SELECT DISTINCT ?uri
WHERE {
         ?uri rdf:type dbo:Person .
         ?uri dbo:office '1st President of the United States'@en .
}
]]></query>
</question>

<question aggregation="false" answertype="boolean" id="93" onlydbo="true">
<string lang="en"><![CDATA[Was Natalie Portman born in the United States?]]></string>
<string lang="de"><![CDATA[Wurde Natalie Portman in den Vereinigten Staaten geboren?]]></string>
<string lang="es"><![CDATA[¿Nació Natalie Portman en los estados unidos de américa?]]></string>
<string lang="it"><![CDATA[Natalie Portman è nata negli Stati Uniti?]]></string>
<string lang="fr"><![CDATA[Natalie Portman est-elle née aux Etats-Unis?]]></string>
<string lang="nl"><![CDATA[Werd Natalie Portman geboren in de Verenigde Staten?]]></string>
<string lang="ro"><![CDATA[A fost Natalie Portman născută în Statele Unite?]]></string>
<keywords lang="en"><![CDATA[Natalie Portman, born, United States]]></keywords>
<keywords lang="de"><![CDATA[Natalie Portman, geboren, Vereinigte Staaten]]></keywords>
<keywords lang="es"><![CDATA[Natalie Portman]]></keywords>
<keywords lang="it"><![CDATA[Natalie Portman, nata, Stati Uniti]]></keywords>
<keywords lang="fr"><![CDATA[Natalie Portman, née, Etats-Unis]]></keywords>
<keywords lang="nl"><![CDATA[Natalie Portman, geboren, Verenigde Staten]]></keywords>
<keywords lang="ro"><![CDATA[Natalie Portman, născută, Statele Unite]]></keywords>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX res: <http://dbpedia.org/resource/>
ASK 
WHERE { 
        res:Natalie_Portman dbo:birthPlace ?city .
        ?city dbo:country res:United_States .
}
]]></query>
</question>

