{
  "dataset": {
    "id": "qald-6-train-multilingual"
  },
  "questions": [
    {
      "id": "63",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all actors starring in Last Action Hero.",
          "keywords": "actor, starring, Last Action Hero"
        },
        {
          "language": "fa",
          "string": "تمام بازیگرانی که در لست اکشن هیرو بازی کردند را لیست کن.",
          "keywords": "بازیگرانی، لست اکشن هیرو، بازی"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schauspieler, die in Last Action Hero mitgespielt haben.",
          "keywords": "Schauspieler, mitspielen, Last Action Hero"
        },
        {
          "language": "es",
          "string": "Dame todos los actores que hayan actuado en Last Action Hero.",
          "keywords": "actores, Last Action Hero"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli attori che hanno recitato in Last Action Hero.",
          "keywords": "attori, Last Action Hero"
        },
        {
          "language": "fr",
          "string": "Noem alle acteurs uit de film Last Action Hero.",
          "keywords": "acteurs, Last Action Hero"
        },
        {
          "language": "nl",
          "string": "Noem alle acteurs uit de film Last Action Hero.",
          "keywords": "acteur, Last Action Hero"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți actorii cu roluri principale în Last Action Hero.",
          "keywords": "actor, rol principal, Last Action Hero"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> ?uri . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/F._Murray_Abraham"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Arnold_Schwarzenegger"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Anthony_Quinn"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Art_Carney"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Robert_Prosky"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Bridgette_Wilson"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Charles_Dance"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Tom_Noonan"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Austin_O'Brien"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "240",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me the grandchildren of Elvis Presley.",
          "keywords": "Elvis Presley, grandchildren"
        },
        {
          "language": "fa",
          "string": "نوه های الویس پرسلی را لیست کن.",
          "keywords": "نوه های، الویس پرسلی"
        },
        {
          "language": "de",
          "string": "Gib mir die Enkel von Elvis Presley.",
          "keywords": "Elvis Presley, Enkel"
        },
        {
          "language": "es",
          "string": "Dame todos los nietos de Elvis Presley.",
          "keywords": "Elvis Presley, nietos"
        },
        {
          "language": "it",
          "string": "Dammi i nipoti di Elvis Presley.",
          "keywords": "Elvis Presley, nipoti"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les petit-enfants de Elvis Presley.",
          "keywords": "petit-enfants, Elvis Presley"
        },
        {
          "language": "nl",
          "string": "Toon alle kleinkinderen van Elvis Presley.",
          "keywords": "Elvis Presley, kleinkinderen"
        },
        {
          "language": "ro",
          "string": "Dă-mi nepoții lui Elvis Presley.",
          "keywords": "Elvis Presley, nepoți"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elvis_Presley> <http://dbpedia.org/ontology/child> ?child . ?child <http://dbpedia.org/ontology/child> ?uri . }"
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Riley_Keough"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "201",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all taikonauts.",
          "keywords": "taikonauts"
        },
        {
          "language": "fa",
          "string": "تمام فضانوردان چینی را لیست کن.",
          "keywords": "فضانوردان، چینی"
        },
        {
          "language": "de",
          "string": "Gib mir alle Taikonauten.",
          "keywords": "Taikonauten"
        },
        {
          "language": "es",
          "string": "Dame todas las taikonautas.",
          "keywords": "taikonautas"
        },
        {
          "language": "it",
          "string": "Dammi tutte i taikonauti.",
          "keywords": "taikonauti"
        },
        {
          "language": "fr",
          "string": "Donnes-moi tous les taïkonautes.",
          "keywords": "taïkonautes"
        },
        {
          "language": "nl",
          "string": "Toon alle taikonauten.",
          "keywords": "taikonauten"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți taikonauții.",
          "keywords": "taikonaut"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Astronaut> .  ?uri <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/China> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Nie_Haisheng"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Liu_Boming_(astronaut)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Fei_Junlong"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Jing_Haipeng"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Zhai_Zhigang"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Tao_Jiali"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "243",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all Swedish oceanographers.",
          "keywords": "Swedish, oceanographer"
        },
        {
          "language": "fa",
          "string": "تمام اقیانوس شناسان سوئدی را لیست کن.",
          "keywords": "اقیانوس شناسان، سوئدی"
        },
        {
          "language": "de",
          "string": "Gib mir alle Schwedischen Ozeanographen.",
          "keywords": "Schwedisch, Ozeanographen"
        },
        {
          "language": "es",
          "string": "Dame todos los oceanógrafos suecos.",
          "keywords": "oceanógrafos suecos"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli oceanografi svedesi.",
          "keywords": "svedesi, oceanografi"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les océanographes suédois.",
          "keywords": "Océanographes, suédois"
        },
        {
          "language": "nl",
          "string": "Toon alle Zweedse oceanograafen.",
          "keywords": "Zweedse, oceanograafen"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți oceanografii suedezi.",
          "keywords": "oceanograf, suedez"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Oceanography> .  ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Sweden> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Vagn_Walfrid_Ekman"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "226",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all actors who were born in Berlin.",
          "keywords": "actors, born, Berlin"
        },
        {
          "language": "fa",
          "string": "تمام بازیگرانی که در برلین متولد شدند را لیست کن.",
          "keywords": "بازیگرانی، برلین، متولد"
        },
        {
          "language": "de",
          "string": "Gib mir alle in Berlin geborenenen Schauspieler.",
          "keywords": "Schauspieler, geboren, Berlin"
        },
        {
          "language": "es",
          "string": "Dame todos los actores nacidos en Berlin.",
          "keywords": "actores, nacidos, Berlin"
        },
        {
          "language": "it",
          "string": "Dammi tutti gli attori nati a Berlino.",
          "keywords": "attori, nati, Berlino"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les acteurs nés à Berlin.",
          "keywords": "acteurs, lieu de naissance, Berlin"
        },
        {
          "language": "nl",
          "string": "Toon alle acteurs die in Berlijn zijn geboren.",
          "keywords": "actuers, geboren, Berlijn"
        },
        {
          "language": "ro",
          "string": "Dă-mi toți actorii care s-au născut la Berlin.",
          "keywords": "actori, născut, Berlin"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> .  ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Jack_Trevor"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Tyra_Misoux"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Dru_Berrymore"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Lena_Nitro"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "233",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me the capitals of all countries that the Himalayas run through.",
          "keywords": "countries Himalayas run through, capitals"
        },
        {
          "language": "fa",
          "string": "پایتخت تمام کشورهایی که هیمالیا از آنها می گذرد را لیست کن.",
          "keywords": "پایتخت، کشورهایی، هیمالیا، می گذرد"
        },
        {
          "language": "de",
          "string": "Gib mir die Haupstädte aller Länder, über die sich der Himalaya erstreckt.",
          "keywords": "Länder, erstrecken, Himalaya, Haupstadt"
        },
        {
          "language": "es",
          "string": "Dame las capitales de todos los países que atraviesa el Himalaya.",
          "keywords": "capital de países, atraviesa el Himalaya"
        },
        {
          "language": "it",
          "string": "Dammi tutte le capitali degli stati attraversati dall'Himalaya.",
          "keywords": "capitali, stati attraversati dall'Himalaya"
        },
        {
          "language": "fr",
          "string": "Donne-moi les capitales de tous les pays que l'Himalaya traverse.",
          "keywords": "capitales, pays, traversé, Himalaya"
        },
        {
          "language": "nl",
          "string": "Toon de hoofdsteden van alle landen waardoor de Himalaya loopt.",
          "keywords": "Himalaya, lopen door, landen, hoofdsteden"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate țările traversate de Himalaya și capitalele lor.",
          "keywords": "țări, traversate de Himalaya, capitale"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/property/country> ?country .  ?country <http://dbpedia.org/ontology/capital> ?uri . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Naypyidaw"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Thimphu"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Beijing"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/New_Delhi"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Kathmandu"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Islamabad"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "254",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Show me the book that Muhammad Ali wrote.",
          "keywords": "book, wrote, Muhammad Ali"
        },
        {
          "language": "fa",
          "string": "کتابی را که محمد علی نوشت را به من نشان بده",
          "keywords": "کتابی، محمد علی، نوشت"
        },
        {
          "language": "de",
          "string": "Zeig mir das Buch, das Muhammad Ali geschrieben hat.",
          "keywords": "Buch, geschrieben, Muhammad Ali"
        },
        {
          "language": "es",
          "string": "Muéstrame el libro escrito por Muhammad Ali.",
          "keywords": "libro, autor, Muhammad Ali"
        },
        {
          "language": "it",
          "string": "Mostrami il libro scritto da Muhammad Ali.",
          "keywords": "libro, autore, Muhammad Ali"
        },
        {
          "language": "fr",
          "string": "Donne-moi le livre écrit par Muhammad Ali.",
          "keywords": "livre, par Muhammad Ali"
        },
        {
          "language": "nl",
          "string": "Toen het boek dat Muhammad Ali heeft geschreven.",
          "keywords": "boek, geschreven, Muhammad Ali"
        },
        {
          "language": "ro",
          "string": "Arată-mi cartea pe care a scris-o Muhammad Ali.",
          "keywords": "carte, scris, Muhammad Ali"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> .  ?uri <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Muhammad_Ali> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/The_Soul_of_a_Butterfly"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "265",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "List all the musicals with music by Leonard Bernstein.",
          "keywords": "musicals, music by, Leonard Bernstein"
        },
        {
          "language": "fa",
          "string": "تمام فیلم های موزیکال با موسیقی لئونارد برنستاین را لیست کن.",
          "keywords": "فیلم های موزیکال، موسیقی، لئونارد برنستاین"
        },
        {
          "language": "de",
          "string": "Liste alle Musicals mit Musik von Leonard Bernstein auf.",
          "keywords": "Musicals, Musik von, Leonard Bernstein"
        },
        {
          "language": "es",
          "string": "Dame todos los musicales con música de Leonard Bernstein.",
          "keywords": "musicales, música, Leonard Bernstein"
        },
        {
          "language": "it",
          "string": "Elenca tutti i musical con musiche di Leonard Bernstein.",
          "keywords": "musicals, musiche, Leonard Bernstein"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les musicals avec de la musique de Leonard Bernstein.",
          "keywords": "musicals, musique, Leonard Bernstein"
        },
        {
          "language": "nl",
          "string": "Toen een lijst van alle musicals met muziek van Leonard Bernstein.",
          "keywords": "musicals, muziek van, Leonard Bernstein"
        },
        {
          "language": "ro",
          "string": "Listează toate muzicalurile cu muzică de Leonard Bernstein.",
          "keywords": "muzicaluri, muzică de Leonard Bernstein"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Musical> .  ?uri <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Side_by_Side_by_Sondheim"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/On_the_Town_(musical)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/West_Side_Story"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "302",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "true",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all Swedish holidays.",
          "keywords": "Swedish holidays"
        },
        {
          "language": "fa",
          "string": "تمام تعطیلات سوئدی را لیست کن.",
          "keywords": "تعطیلات سوئدی"
        },
        {
          "language": "de",
          "string": "Gib mir alle schwedischen Feiertage.",
          "keywords": "schwedische Feiertage"
        },
        {
          "language": "es",
          "string": "Dame todos los días festivos en Suecia.",
          "keywords": "días festivos, Suecia"
        },
        {
          "language": "it",
          "string": "Dammi tutti i giorni festivi svedesi.",
          "keywords": "giorni festivi svedesi"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les jours fériés en Suède.",
          "keywords": "jours fériés, Suède"
        },
        {
          "language": "nl",
          "string": "Geef alle Zweedse feestdagen.",
          "keywords": "Zweedse feestdagen"
        },
        {
          "language": "ro",
          "string": "Dă toate zilele de sărbătoare din Suedia.",
          "keywords": "zile de sărbătoare, Suedia"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Holiday> .  ?uri <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Black_Friday_(shopping)"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/St._Knut's_Day"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Gustavus_Adolphus_Day"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Veterans_Day_(Sweden)"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "326",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "Give me all spacecrafts that flew to Mars.",
          "keywords": "spacecrafts, flew to, Mars"
        },
        {
          "language": "fa",
          "string": "تمام فضاپیماهایی که به مریخ پرواز کردند را لیست کن.",
          "keywords": "فضاپیماهایی، مریخ، پرواز"
        },
        {
          "language": "de",
          "string": "Zeig mir alle Raumschiffe, die zum Mars geflogen sind.",
          "keywords": "Raumschiffe, geflogen, Mars"
        },
        {
          "language": "es",
          "string": "Dame todas las naves espaciales que han volado a Marte",
          "keywords": "naves espaciales, volado, Marte"
        },
        {
          "language": "it",
          "string": "Dammi tutte le astronavi che hanno volato su Marte.",
          "keywords": "astronavi, volare, Marte"
        },
        {
          "language": "fr",
          "string": "Donne-moi tous les vaisseaux spatiaux qui ont volé pour Mars.",
          "keywords": "vaisseaux spatiaux, volé, Mars"
        },
        {
          "language": "nl",
          "string": "Geef alle ruimtetuigen die naar Mars werden gestuurd.",
          "keywords": "ruimtetuigen, gestuurd, Mars"
        },
        {
          "language": "ro",
          "string": "Dă-mi toate navele spațiale care au zburat spre Marte.",
          "keywords": "nave spațiale, zburat, Marte"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Spacecraft> .  ?uri <http://dbpedia.org/property/planet> <http://dbpedia.org/resource/Mars> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/ExoMars_rover"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Mars_2020"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Mars_Science_Laboratory"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/MELOS"
                }
              }
            ]
          }
        }
      ]
    },
    {
      "id": "346",
      "answertype": "resource",
      "aggregation": "false",
      "onlydbo": "false",
      "hybrid": "false",
      "question": [
        {
          "language": "en",
          "string": "List the seven kings of Rome.",
          "keywords": "kings, Rome"
        },
        {
          "language": "fa",
          "string": "هفت پادشاه رم را لیست کن.",
          "keywords": "پادشاه، رم"
        },
        {
          "language": "de",
          "string": "Gib mir eine Liste aller Könige von Rom.",
          "keywords": "Könige, Rom"
        },
        {
          "language": "es",
          "string": "Lista los siete reyes de Roma.",
          "keywords": "siete reyes Roma"
        },
        {
          "language": "it",
          "string": "Elenca i sette re di Roma.",
          "keywords": "sette re, Roma"
        },
        {
          "language": "fr",
          "string": "Donne-moi les sept rois de Rome.",
          "keywords": "rois, Rome"
        },
        {
          "language": "nl",
          "string": "Geef de seven koningen van Rome.",
          "keywords": "koningen, Rome"
        },
        {
          "language": "ro",
          "string": "Enumeră cei șapte regi ai Romei.",
          "keywords": "șapte regi, Roma"
        }
      ],
      "query": {
        "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> . } "
      },
      "answers": [
        {
          "head": {
            "vars": [
              "uri"
            ]
          },
          "results": {
            "bindings": [
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Numa_Pompilius"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Romulus_and_Remus"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Ancus_Marcius"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Lucius_Tarquinius_Priscus"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Lucius_Tarquinius_Superbus"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Servius_Tullius"
                }
              },
              {
                "uri": {
                  "type": "uri",
                  "value": "http://dbpedia.org/resource/Tullus_Hostilius"
                }
              }
            ]
          }
        }
      ]
    }
  ]
}
