<?xml version="1.0" ?>
<dataset id="dbpedia-train">

<question id="63" answertype="resource" aggregation="false" yago="false">
<string><![CDATA[
Give me all actors starring in Batman Begins.
]]></string>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri ?string 
WHERE {
	{ res:Batman_Begins dbo:starring ?uri . } UNION { res:Batman_Begins dbp:starring ?uri . }
	OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } 
}
]]></query>
</question>

<question id="73" answertype="resource" aggregation="false" yago="false">
<string><![CDATA[
Who owns Aldi?
]]></string>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
SELECT DISTINCT ?uri ?string 
WHERE {
	?orga rdf:type dbo:Organisation .
	?orga dbo:keyPerson ?uri .
	?orga rdfs:label 'Aldi'@en .
	OPTIONAL { ?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

<question id="84" answertype="resource" aggregation="false" yago="false">
<string><![CDATA[
Give me all movies with Tom Cruise.
]]></string>
<query><![CDATA[
PREFIX dbo: <http://dbpedia.org/ontology/>
PREFIX dbp: <http://dbpedia.org/property/>
PREFIX res: <http://dbpedia.org/resource/>
SELECT DISTINCT ?uri ?string 
WHERE {
	?uri rdf:type dbo:Film.
	{ ?uri dbp:starring res:Tom_Cruise . } UNION { ?uri dbo:starring res:Tom_Cruise . }
	OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
]]></query>
</question>

