<?xml version="1.0" encoding="UTF-8"?>
<dataset id="musicbrainz-train">
<question id="46">
<string>
List all members of The Notwist.
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX ar: &lt;http://musicbrainz.org/ar/ar-1.0#&gt;
SELECT ?artist ?name 
WHERE {
  ?artist ar:memberOfBand ?bandinstance .
  ?bandinstance ar:toArtist ?band .
  ?band dc:title 'The Notwist' .
  ?artist dc:title ?name .
}
</query>
<answers>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/0a018360-3bc2-4cca-bb34-406bd5882334
</uri>
<string>
Martin Messerschmid
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/c4d30869-2366-45ef-8bab-c671aae79d2d
</uri>
<string>
Markus Acher
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/ca134505-1fcc-40a3-bef2-4f344b86d1f8
</uri>
<string>
Console
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/cd967b9f-fb7b-4944-aca0-7fc09678407f
</uri>
<string>
Micha Acher
</string>
</answer>
</answers>
</question>
<question id="32">
<string>
Which artists died on the same day as Michael Jackson?
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX mm: &lt;http://musicbrainz.org/mm/mm-2.1#&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT ?artist ?name 
WHERE {
  ?artist rdf:type mm:Artist .
  ?artist mm:artistType mm:TypePerson .
  ?mj dc:title 'Michael Jackson' .
  ?mj mm:endDate ?date .
  ?artist mm:endDate ?date .
  ?artist dc:title ?name .
  FILTER (!sameTerm(?artist,?mj))
}
</query>
<answers>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/02e7d4da-40e4-4689-9a9c-37f11d656994
</uri>
<string>
Yasmine
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/4fa2fa1f-81b8-4a20-99e3-5aa1965ebb0e
</uri>
<string>
Sky Saxon
</string>
</answer>
</answers>
</question>
<question id="16">
<string>
Give me all bands that Michael Stipe is a member of.
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX mm: &lt;http://musicbrainz.org/mm/mm-2.1#&gt;
PREFIX ar: &lt;http://musicbrainz.org/ar/ar-1.0#&gt;
SELECT ?band ?title
WHERE { 
 ?artist dc:title 'Michael Stipe' .
 ?artist ar:memberOfBand ?bandinstance .
 ?bandinstance ar:toArtist ?band .
 ?band dc:title ?title .
}
</query>
<answers>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/907981c8-f6be-4d8d-9210-01a0c4843b59
</uri>
<string>
The Golden Palominos
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/ea4dfa26-f633-4da6-a52a-f49ea4897b58
</uri>
<string>
R.E.M.
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/44e9e832-3f85-4094-a332-7d0548224cb2
</uri>
<string>
Bingo Hand Job
</string>
</answer>
</answers>
</question>
<question id="4">
<string>
How may albums did Michael Jackson record?
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
SELECT COUNT(?albumtitle)
WHERE {
	?album dc:title ?albumtitle .
	?album dc:creator ?artist .
	?artist dc:title 'Michael Jackson' .
}
</query>
<answers>
<answer>
<number>
606
</number>
</answer>
</answers>
</question>
<question id="49">
<string>
Until when was Tina Turner married to Ike Turner?
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX mm: &lt;http://musicbrainz.org/mm/mm-2.1#&gt;
PREFIX ar: &lt;http://musicbrainz.org/ar/ar-1.0#&gt;
SELECT ?date
WHERE {
  ?artist dc:title 'Tina Turner' .
  ?artist ar:marriedTo ?spouseinstance .
  ?spouseinstance ar:toArtist ?spouse .
  ?spouse dc:title 'Ike Turner' .
  ?spouseinstance mm:endDate ?date .
}
</query>
<answers>
<answer>
<date>
1978-01-01
</date>
</answer>
</answers>
</question>
<question id="23">
<string>
Since when does Fugazi exist?
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX mm: &lt;http://musicbrainz.org/mm/mm-2.1#&gt;
SELECT ?date
WHERE {
    ?artist dc:title 'Fugazi'.
    ?artist mm:beginDate ?date.
}
</query>
<answers>
<answer>
<date>
1987-00-00
</date>
</answer>
</answers>
</question>
<question id="39">
<string>
Give me all former members of the Berliner Philharmoniker.
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX ar: &lt;http://musicbrainz.org/ar/ar-1.0#&gt;
PREFIX mm: &lt;http://musicbrainz.org/mm/mm-2.1#&gt;
SELECT ?member ?name
WHERE { 
  ?member ar:memberOfBand ?orchestrainstance .
  ?orchestrainstance ar:toArtist ?orchestra . 
  ?orchestra dc:title 'Berliner Philharmoniker' .
  ?member dc:title ?name .
  OPTIONAL { ?orchestrainstance mm:endDate ?date .}
  FILTER (bound(?date))
}
</query>
<answers>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/0d1af11b-9236-4cc4-8141-9ece7a495756
</uri>
<string>
Wolfgang Boettcher
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/65a44f13-d63e-4516-a094-f3a5307e877f
</uri>
<string>
Lothar Koch
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/6afe0f78-8e90-4539-b562-dfae433d41f2
</uri>
<string>
Karl Leister
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/84045b93-beb0-4bc8-a855-93266ec6bbdc
</uri>
<string>
James Galway
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/87b816f9-749b-42b2-9670-5d3a503bd9e9
</uri>
<string>
Eberhard Finke
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/baa8f822-fc5e-49bb-92cb-df7a65071e8e
</uri>
<string>
Henning Trog
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/d34f1593-36d4-42ad-8b56-fa9f2ea129c2
</uri>
<string>
Gerd Seifert
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/e4669b9c-b321-4586-b18f-6f84724a6d4a
</uri>
<string>
Götz Teutsch
</string>
</answer>
</answers>
</question>
<question id="50">
<string>
Give me the names of John Lennons children?
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX ar: &lt;http://musicbrainz.org/ar/ar-1.0#&gt;
SELECT DISTINCT ?name
WHERE {
  ?artist dc:title 'John Lennon' .
  ?artist ar:isParent ?childinstance .
  ?childinstance ar:toArtist ?child .
  ?child dc:title ?name .
}
</query>
<answers>
<answer>
<string>
Sean Lennon
</string>
</answer>
<answer>
<string>
Julian Lennon
</string>
</answer>
</answers>
</question>
<question id="7">
<string>
Give me the present members of The Cure.
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX ar: &lt;http://musicbrainz.org/ar/ar-1.0#&gt;
PREFIX mm: &lt;http://musicbrainz.org/mm/mm-2.1#&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT ?artist ?name
WHERE {
  ?band rdf:type mm:Artist .
  ?band dc:title 'The Cure' .
  ?artist ar:memberOfBand ?bandinstance .
  ?bandinstance ar:toArtist ?band .
  ?artist dc:title ?name .
  OPTIONAL {?bandinstance mm:endDate ?date .}
  FILTER (!bound(?date))
}
</query>
<answers>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/2b2a7e94-fdc6-4c2e-859c-441faa4089cd
</uri>
<string>
Porl Thompson
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/48555d10-ded8-4172-a737-33bffc0125d5
</uri>
<string>
Simon Gallup
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/7d1a1624-784b-4f89-8ff9-b9b493cd059d
</uri>
<string>
Robert Smith
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/e83e045f-2191-4ccd-b8ba-7d93852b6f9b
</uri>
<string>
Jason Cooper
</string>
</answer>
</answers>
</question>
<question id="15">
<string>
Give me all albums with the BBC Symphony Orchestra.
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX mm: &lt;http://musicbrainz.org/mm/mm-2.1#&gt;
PREFIX ar: &lt;http://musicbrainz.org/ar/ar-1.0#&gt;
SELECT ?album ?title
WHERE {
  ?album rdf:type mm:Album .
  ?album ar:performingOrchestra ?orchestra .
  ?orchestra dc:title 'BBC Symphony Orchestra' .
  ?album dc:title ?title .
}
</query>
<answers>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/4bc8b3da-9cc8-48e6-bfab-1ec94626e0d4
</uri>
<string>
Brahms
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/63f82ef6-1ce9-4ea0-9c3d-a9de4640016c
</uri>
<string>
Last Night of the Proms (The 100th Season)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/e9cad5e7-4f41-4b7a-83f3-60554a0a8614
</uri>
<string>
Beethoven/Mozart: Piano Concertos (Clifford Curzon)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/18a7aa23-6656-4e39-8ef7-c3a3a4f7ddaf
</uri>
<string>
The Young Person's Guide to the Orchestra / Four Sea Interludes (BBC Symphony Orchestra feat. conductor: Sir Andrew Davis)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/c7f1341d-874e-4533-a0bb-5abe77abcb6d
</uri>
<string>
The Perlman Edition (disc 5: Prokofiev Violin Concertos &amp; Sonata for Two Violins)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/3e559fdd-0bc1-452a-90f6-ae71fb600d83
</uri>
<string>
Enigma Variations / Pomp and Circumstance / The Crown of India (BBC Symphony Orchestra, feat. conductor: Leonard Bernstein)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/02cbf72c-8b93-4e3c-86ee-a6e7ea586296
</uri>
<string>
Cockaigne Overture / Introduction and Allegro / Serenade in E minor / Enigma Variations (BBC Symphony Orchestra feat. conductor: Andrew Davis)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/578da6d4-a5fc-4255-85e9-0a124f07f93f
</uri>
<string>
The Dharma at Big Sur / My Father Knew Charles Ives (BBC Symphony Orchestra feat. conductor: John Adams) (disc 1)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/e6b43d6f-6c32-4a12-b93f-2e6680b82082
</uri>
<string>
The Dharma at Big Sur / My Father Knew Charles Ives (BBC Symphony Orchestra feat. conductor: John Adams) (disc 2)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/a2988172-5ede-41b9-bf04-5259b9bc613d
</uri>
<string>
Pli Selon Pli / Le Visage Nuptial / Le Soleil des eaux / Figures, Doubles, Prismes (BBC Symphony Orchestra feat. conductor: Pierre Boulez) (disc 2)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/b2558e90-0506-4d8c-82b5-2ae9e29a7a71
</uri>
<string>
The Isle of the Dead, Op. 29 / Two Études-tableaux / Pictures at an Exhibition (BBC Symphony Orchestra feat. conductor Evgeny Svetlanov)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/5dcc5017-3fbd-457e-9326-31fce3f63905
</uri>
<string>
Vanessa (BBC Symphony Orchestra feat. conductor: Leonard Slatkin) (disc 1)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/a478a8a3-5c3e-4fc7-b201-04531cb84a83
</uri>
<string>
Vanessa (BBC Symphony Orchestra feat. conductor: Leonard Slatkin) (disc 2)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/c8b9f993-c476-4ec7-947c-35cebe4f314c
</uri>
<string>
A Sea Symphony (BBC Symphony Orchestra &amp; Chorus feat. conductor: Andrew Davis)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/43da5103-3b0e-41b9-9a4e-9fedc05621c4
</uri>
<string>
Falstaff / Romance for Bassoon / Grania and Diarmid / Froissart
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/3f4f58cf-56e5-48a0-9488-3c2b09a5a1ae
</uri>
<string>
Not the Messiah (He's a Very Naughty Boy)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/24cf9b07-2f9e-4589-96ce-906f778dafc7
</uri>
<string>
Taverner (BBC Symphony Orchestra feat. conductor: Oliver Knussen) (disc 1)
</string>
</answer>
</answers>
</question>
<question id="20">
<string>
How long is the Miami Vice theme?
</string>
<query>
PREFIX mm: &lt;http://musicbrainz.org/mm/mm-2.1#&gt;
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT ?duration
WHERE {
  ?track rdf:type mm:Track . 
  ?track dc:title ?title .
  ?track mm:duration ?duration .
  FILTER (regex(?title,'Miami Vice') &amp;&amp; regex(?title,'theme'))
}
</query>
<answers>
<answer>
<string>
150.266
</string>
</answer>
</answers>
</question>
<question id="29">
<string>
Give me all people who were members of The Beatles.
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX ar: &lt;http://musicbrainz.org/ar/ar-1.0#&gt;
PREFIX mm: &lt;http://musicbrainz.org/mm/mm-2.1#&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT ?artist ?name
WHERE {
  ?artist rdf:type mm:Artist .
  ?artist mm:artistType mm:TypePerson .
  ?artist ar:memberOfBand ?bandinstance .
  ?bandinstance ar:toArtist ?band .
  ?band dc:title 'The Beatles' .
  ?artist dc:title ?name .
}
</query>
<answers>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/0d4ab0f9-bbda-4ab1-ae2c-f772ffcfbea9
</uri>
<string>
Pete Best
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/300c4c73-33ac-4255-9d57-4e32627f5e13
</uri>
<string>
Ringo Starr
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/42a8f507-8412-4611-854f-926571049fa0
</uri>
<string>
George Harrison
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/49a51491-650e-44b3-8085-2f07ac2986dd
</uri>
<string>
Stuart Sutcliffe
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/4d5447d7-c61c-4120-ba1b-d7f471d385b9
</uri>
<string>
John Lennon
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/artist/ba550d0e-adac-4864-b88b-407cab5e76af
</uri>
<string>
Paul McCartney
</string>
</answer>
</answers>
</question>
<question id="6">
<string>
Which artists have their 50th birthday on May 30, 2011?
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX mm: &lt;http://musicbrainz.org/mm/mm-2.1#&gt;
SELECT ?artistname 
WHERE {
  ?artist dc:title ?artistname .
  ?artist mm:beginDate "1961-05-30"^^xsd:dateTime .
}
</query>
<answers>
<answer>
<string>
Harry Enfield
</string>
</answer>
<answer>
<string>
Tom McManamon
</string>
</answer>
<answer>
<string>
Harry Enfield
</string>
<string>
Tom McManamon
</string>
</answer>
</answers>
</question>
<question id="3">
<string>
When was the band Green Day founded?
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX mm: &lt;http://musicbrainz.org/mm/mm-2.1#&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT ?date
WHERE {
    ?artist rdf:type mm:Artist .
    ?artist mm:artistType mm:TypeGroup .
    ?artist dc:title 'Green Day'.
    ?artist mm:beginDate ?date .
}
</query>
<answers>
<answer>
<date>
1989-00-00
</date>
</answer>
</answers>
</question>
<question id="18">
<string>
Show me all live albums by Michael Jackson!
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX mm: &lt;http://musicbrainz.org/mm/mm-2.1#&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
SELECT ?album ?title
WHERE {
  ?album rdf:type mm:Album . 
  ?album mm:releaseType mm:TypeLive .
  ?album dc:title ?title .
  ?album dc:creator ?artist .
  ?artist dc:title 'Michael Jackson' .
}
</query>
<answers>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/90092a8c-899d-47af-aebc-a7806dd2bd67
</uri>
<string>
In Concert
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/3691c708-504e-4035-b987-f78c89c3294d
</uri>
<string>
Heal the World Tour 92
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/c995c23e-83f4-4364-a13d-7ab17e6ab6f1
</uri>
<string>
1988: Bad Tour Live in Rotterdam 1988
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/5c7cd653-5cab-43cf-9969-a823c619048a
</uri>
<date>
1988-03-05: Madison Square Garden, New York, NY, USA
</date>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/90663c57-b44d-4558-ba3d-b37673d54822
</uri>
<string>
Live in Bucharest: The Dangerous Tour (disc 1)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/2d332333-5ccb-4560-a47d-3e605d2728d8
</uri>
<string>
Live in Bucharest: The Dangerous Tour (disc 2)
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/011dd451-1910-4ab5-b83f-63f65f6c9dcc
</uri>
<string>
You Were There
</string>
</answer>
<answer>
<uri>
http://musicbrainz.org/mm-2.1/album/36b9f2f1-1ba8-4e36-a97e-739ae02a6c56
</uri>
<string>
All of It (Bucharest live October 92)
</string>
</answer>
</answers>
</question>
<question id="30">
<string>
Give me the birthdays of all members of The Beatles.
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX ar: &lt;http://musicbrainz.org/ar/ar-1.0#&gt;
PREFIX mm: &lt;http://musicbrainz.org/mm/mm-2.1#&gt;
SELECT ?date
WHERE {
  ?artist ar:memberOfBand ?bandinstance .
  ?bandinstance ar:toArtist ?band .
  ?band dc:title 'The Beatles' .
  ?artist mm:beginDate ?date .
}
</query>
<answers>
<answer>
<date>
1941-11-24
</date>
<string>
1940-07-07
</string>
</answer>
<answer>
<date>
1943-02-24
</date>
<string>
1940-06-23
</string>
</answer>
<answer>
<string>
1940-10-09
</string>
<date>
1942-06-18
</date>
</answer>
</answers>
</question>
<question id="25">
<string>
Are the members of the Ramones that are not called Ramone?
</string>
<query>
PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
PREFIX ar: &lt;http://musicbrainz.org/ar/ar-1.0#&gt;
ASK WHERE {
	?band dc:title 'Ramones' .
	?artist dc:title ?name .
	?artist ar:memberOfBand ?bandinstance .
	?bandinstance ar:toArtist ?band .
        FILTER (NOT regex(?name,"Ramone"))
}
</query>
<answers>
<answer>
<boolean>
false
</boolean>
</answer>
</answers>
</question>
