<?xml version="1.0" ?>
<dataset id="dbpedia-train">
<question id="29">
<string>
What is the official website of Tom Hanks?
</string>
<query>
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX foaf: &lt;http://xmlns.com/foaf/0.1/&gt;
SELECT ?uri
WHERE
{ 
	?subject  rdfs:label 'Tom Hanks'@en .
        ?subject foaf:homepage ?uri
}
</query>
<answers>
<answer>
<uri>
http://www.youtube.com/tomhankschannel
</uri>
</answer>
</answers>
</question>
<question id="37">
<string>
List all episodes of the first season of the HBO television series The Sopranos!
</string>
<query>
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX onto: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
SELECT ?uri ?string
WHERE
{
	?uri onto:series res:The_Sopranos  .
        ?uri onto:seasonNumber 1 .
	OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
</query>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/46_Long
</uri>
<string>
46 Long
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/A_Hit_Is_a_Hit
</uri>
<string>
A Hit Is a Hit
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Down_Neck
</uri>
<string>
Down Neck
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/I_Dream_of_Jeannie_Cusamano
</uri>
<string>
I Dream of Jeannie Cusamano
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Nobody_Knows_Anything
</uri>
<string>
Nobody Knows Anything
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Pax_Soprana
</uri>
<string>
Pax Soprana
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/The_Legend_of_Tennessee_Moltisanti
</uri>
<string>
The Legend of Tennessee Moltisanti
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Isabella_%28The_Sopranos%29
</uri>
<string>
Isabella (The Sopranos)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Denial,_Anger,_Acceptance
</uri>
<string>
Denial, Anger, Acceptance
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Meadowlands_%28The_Sopranos%29
</uri>
<string>
Meadowlands (The Sopranos)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/The_Sopranos_%28episode%29
</uri>
<string>
The Sopranos (episode)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Boca_%28The_Sopranos%29
</uri>
<string>
Boca (The Sopranos)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/College_%28The_Sopranos%29
</uri>
<string>
College (The Sopranos)
</string>
</answer>
</answers>
</question>
<question id="35">
<string>
Give me all actors starring in Batman Begins.
</string>
<query>
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
PREFIX foaf: &lt;http://xmlns.com/foaf/0.1/&gt;
PREFIX onto: &lt;http://dbpedia.org/ontology/&gt;
SELECT ?uri ?string
WHERE 
{
	?film rdf:type onto:Film .
        ?film onto:starring ?uri .
        ?film foaf:name 'Batman Begins'@en .
	OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } 
}
</query>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Christian_Bale
</uri>
<string>
Christian Bale
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Cillian_Murphy
</uri>
<string>
Cillian Murphy
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Gary_Oldman
</uri>
<string>
Gary Oldman
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Katie_Holmes
</uri>
<string>
Katie Holmes
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Liam_Neeson
</uri>
<string>
Liam Neeson
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Michael_Caine
</uri>
<string>
Michael Caine
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Morgan_Freeman
</uri>
<string>
Morgan Freeman
</string>
</answer>
</answers>
</question>
<question id="50">
<string>
Give me the websites of companies with more than 500000 employees.
</string>
<query>
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
PREFIX prop: &lt;http://dbpedia.org/property/&gt;
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
PREFIX foaf: &lt;http://xmlns.com/foaf/0.1/&gt;
PREFIX onto: &lt;http://dbpedia.org/ontology/&gt;
SELECT DISTINCT ?uri 
WHERE 
{
	?subject rdf:type onto:Company .
	?subject prop:numEmployees ?employees .
	FILTER( xsd:integer(?employees) &gt;= 500000 ) .
	?subject foaf:homepage ?uri .
}
</query>
<answers>
<answer>
<uri>
http://www.dhl.com/
</uri>
</answer>
<answer>
<uri>
http://www.g4s.com/
</uri>
</answer>
<answer>
<uri>
http://www.usps.com/
</uri>
</answer>
<answer>
<uri>
http://qt.nokia.com/
</uri>
</answer>
<answer>
<uri>
http://www.tmx.com/exchange
</uri>
</answer>
<answer>
<uri>
http://www.asx.com.au/
</uri>
</answer>
<answer>
<uri>
http://www.asx.com.au
</uri>
</answer>
<answer>
<uri>
http://www.verisign.com/
</uri>
</answer>
<answer>
<uri>
http://www.dhl.com/
</uri>
<uri>
http://www.g4s.com/
</uri>
</answer>
<answer>
<uri>
http://www.usps.com/
</uri>
<uri>
http://qt.nokia.com/
</uri>
</answer>
<answer>
<uri>
http://www.tmx.com/exchange
</uri>
<uri>
http://www.asx.com.au/
</uri>
</answer>
<answer>
<uri>
http://www.asx.com.au
</uri>
<uri>
http://www.verisign.com/
</uri>
</answer>
</answers>
</question>
<question id="20">
<string>
Which country does the Airedale Terrier come from?
</string>
<query>
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX prop: &lt;http://dbpedia.org/property/&gt;
SELECT ?string
WHERE 
{
	?dog rdfs:label 'Airedale Terrier'@en .
        ?dog prop:country ?string      
}
</query>
<answers>
<answer>
<string>
England
</string>
</answer>
</answers>
</question>
<question id="13">
<string>
Which cities have more than 2 million inhabitants?
</string>
<query>
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
PREFIX prop: &lt;http://dbpedia.org/property/&gt;
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
PREFIX onto: &lt;http://dbpedia.org/ontology/&gt;
SELECT DISTINCT ?uri ?string
WHERE 
{ 
	?uri rdf:type onto:City.
      { ?uri prop:population ?population. } 
        UNION 
      { ?uri prop:populationUrban ?population. }
	FILTER (xsd:integer(?population) &gt; 2000000) .
	OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
</query>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Berlin
</uri>
<string>
Berlin
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Ningbo
</uri>
<string>
Ningbo
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Manchester
</uri>
<string>
Manchester
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Salt_Lake_City
</uri>
<string>
Salt Lake City
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Eden_Prairie,_Minnesota
</uri>
<string>
Eden Prairie, Minnesota
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Suzhou
</uri>
<string>
Suzhou
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Nanning
</uri>
<string>
Nanning
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Shijiazhuang
</uri>
<string>
Shijiazhuang
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Xi%27an
</uri>
<string>
Xi'an
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Tampa,_Florida
</uri>
<string>
Tampa, Florida
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Fuzhou
</uri>
<string>
Fuzhou
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Changsha
</uri>
<string>
Changsha
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Qingdao
</uri>
<string>
Qingdao
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Harare
</uri>
<string>
Harare
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/San_Diego
</uri>
<string>
San Diego
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Santo_Domingo
</uri>
<string>
Santo Domingo
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Kunming
</uri>
<string>
Kunming
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/San_Francisco
</uri>
<string>
San Francisco
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Madison,_Wisconsin
</uri>
<string>
Madison, Wisconsin
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Atlanta
</uri>
<string>
Atlanta
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Hangzhou
</uri>
<string>
Hangzhou
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Dalian
</uri>
<string>
Dalian
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Changchun
</uri>
<string>
Changchun
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Houston
</uri>
<string>
Houston
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Detroit
</uri>
<string>
Detroit
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Shenzhen
</uri>
<string>
Shenzhen
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Fairfax,_Virginia
</uri>
<string>
Fairfax, Virginia
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Zhengzhou
</uri>
<string>
Zhengzhou
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Harbin
</uri>
<string>
Harbin
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Shenyang
</uri>
<string>
Shenyang
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Miami
</uri>
<string>
Miami
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Philadelphia
</uri>
<string>
Philadelphia
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Wuhan
</uri>
<string>
Wuhan
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/San_Jose,_California
</uri>
<string>
San Jose, California
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Tehran
</uri>
<string>
Tehran
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Chicago
</uri>
<string>
Chicago
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Los_Angeles
</uri>
<string>
Los Angeles
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Manila
</uri>
<string>
Manila
</string>
</answer>
</answers>
</question>
<question id="26">
<string>
When was DBpedia released?
</string>
<query>
PREFIX onto: &lt;http://dbpedia.org/ontology/&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
SELECT ?date
WHERE 
{
	?website rdf:type onto:Software .
        ?website onto:releaseDate ?date .
        ?website rdfs:label 'DBpedia'@en   
}
</query>
<answers>
<answer>
<string>
2007-01-23
</string>
</answer>
</answers>
</question>
<question id="18">
<string>
What languages are spoken in Estonia?
</string>
<query>
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
PREFIX onto: &lt;http://dbpedia.org/ontology/&gt;
SELECT DISTINCT ?uri ?string
WHERE 
{ 
      ?country rdf:type onto:Country.
      { ?country onto:language ?uri . } 
      UNION 
      { ?uri onto:spokenIn ?country . }
      FILTER (regex(?country, 'Estonia')).
      OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
</query>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Estonian_language
</uri>
<string>
Estonian language
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Erzya_language
</uri>
<string>
Erzya language
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Estonian_Sign_Language
</uri>
<string>
Estonian Sign Language
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Modern_Swedish
</uri>
<string>
Modern Swedish
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Russian_Sign_Language
</uri>
<string>
Russian Sign Language
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/V%C3%B5ro_language
</uri>
<string>
Võro language
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Laiuse_Romani_language
</uri>
<string>
Laiuse Romani language
</string>
</answer>
</answers>
</question>
<question id="14">
<string>
Who owns Aldi?
</string>
<query>
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
PREFIX onto: &lt;http://dbpedia.org/ontology/&gt;
SELECT ?uri ?string
WHERE 
{
	?orga rdf:type onto:Organisation .
	?orga onto:keyPerson ?uri .
	?orga rdfs:label 'Aldi'@en .
	OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
        FILTER (lang(?string) = 'en') 
}
</query>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Karl_Albrecht
</uri>
<string>
Karl Albrecht
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Theo_Albrecht
</uri>
<string>
Theo Albrecht
</string>
</answer>
</answers>
</question>
<question id="25">
<string>
Which genre does DBpedia belong to?
</string>
<query>
PREFIX prop: &lt;http://dbpedia.org/property/&gt;
PREFIX onto: &lt;http://dbpedia.org/ontology/&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
SELECT ?uri ?string
WHERE 
{
	?dbpedia rdf:type onto:Software .
        ?dbpedia onto:genre ?uri .
        ?dbpedia rdfs:label 'DBpedia'@en .
        OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') } 
}
</query>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Linked_Data
</uri>
<string>
Linked Data
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Semantic_Web
</uri>
<string>
Semantic Web
</string>
</answer>
</answers>
</question>
<question id="36">
<string>
Give me all movies with Tom Cruise!
</string>
<query>
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX onto: &lt;http://dbpedia.org/ontology/&gt;
PREFIX res: &lt;http://dbpedia.org/resource/&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
PREFIX prop: &lt;http://dbpedia.org/property/&gt;
SELECT DISTINCT ?uri ?string
WHERE 
{
	?uri rdf:type onto:Film.
	{ ?uri prop:starring res:Tom_Cruise . }
        UNION
        { ?uri onto:starring res:Tom_Cruise . }
	OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
</query>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Eyes_Wide_Shut
</uri>
<string>
Eyes Wide Shut
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Jerry_Maguire
</uri>
<string>
Jerry Maguire
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Magnolia_%28film%29
</uri>
<string>
Magnolia (film)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Minority_Report_%28film%29
</uri>
<string>
Minority Report (film)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Rain_Man
</uri>
<string>
Rain Man
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/The_Color_of_Money
</uri>
<string>
The Color of Money
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/The_Firm_%281993_film%29
</uri>
<string>
The Firm (1993 film)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/A_Few_Good_Men
</uri>
<string>
A Few Good Men
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/All_the_Right_Moves
</uri>
<string>
All the Right Moves
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Born_on_the_Fourth_of_July_%28film%29
</uri>
<string>
Born on the Fourth of July (film)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Cocktail_%28film%29
</uri>
<string>
Cocktail (film)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Collateral_%28film%29
</uri> 	
<string>
Collateral (film)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Days_of_Thunder
</uri> 	
<string>
Days of Thunder
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Endless_Love_%28film%29
</uri> 	
<string>
Endless Love (film)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Far_and_Away
</uri> 	
<string>
Far and Away
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Interview_with_the_Vampire:_The_Vampire_Chronicles
</uri> 	
<string>
Interview with the Vampire: The Vampire Chronicles
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Legend_%28film%29
</uri> 	
<string>
Legend (film)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Lions_for_Lambs
</uri> 	
<string>
Lions for Lambs
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Losin%27_It
</uri> 	
<string>
Losin' It
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Mission:_Impossible_%28film%29
</uri> 	
<string>
Mission: Impossible (film)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Mission:_Impossible_III
</uri> 	
<string>
Mission: Impossible III
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Risky_Business
</uri> 	
<string>
Risky Business
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Taps_%28film%29
</uri> 	
<string>
Taps (film)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/The_Last_Samurai
</uri> 	
<string>
The Last Samurai
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/The_Outsiders_%28film%29
</uri> 	
<string>
The Outsiders (film)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Tropic_Thunder
</uri> 	
<string>
Tropic Thunder
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Valkyrie_%28film%29
</uri> 	
<string>
Valkyrie (film)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Vanilla_Sky
</uri> 	
<string>
Vanilla Sky
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/War_of_the_Worlds_%282005_film%29
</uri> 	
<string>
War of the Worlds (2005 film)
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Top_Gun
</uri> 	
<string>
Top Gun
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Mission:_Impossible_IV
</uri> 	
<string>
Mission: Impossible IV
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Mission:_Impossible_%28film_series%29
</uri> 	
<string>
Mission: Impossible (film series)
</string>
</answer>
</answers>
</question>
<question id="3">
<string>
Give me all female German chancellors!
</string>
<query>
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX yago: &lt;http://dbpedia.org/class/yago/&gt;
PREFIX prop: &lt;http://dbpedia.org/property/&gt;
SELECT ?uri ?string
WHERE 
{
	?uri rdf:type yago:FemaleHeadsOfGovernment.
        ?uri prop:office ?office .
        FILTER regex(?office, 'Chancellor of Germany').        
        OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
</query>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Angela_Merkel
</uri>
<string>
Angela Merkel
</string>
</answer>
</answers>
</question>
<question id="16">
<string>
Give me all soccer clubs in the Premier League.
</string>
<query>
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX onto: &lt;http://dbpedia.org/ontology/&gt;
PREFIX resource: &lt;http://dbpedia.org/resource/&gt;
SELECT DISTINCT ?uri ?string
WHERE
{ 
   ?uri onto:league resource:Premier_League . 
   OPTIONAL {?uri rdfs:label ?string . FILTER (lang(?string) = 'en') }
}
</query>
<answers>
<answer>
<uri>
http://dbpedia.org/resource/Arsenal_F.C.
</uri>
<string>
Arsenal F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Aston_Villa_F.C.
</uri>
<string>
Aston Villa F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Birmingham_City_F.C.
</uri>
<string>
Birmingham City F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Blackburn_Rovers_F.C.
</uri>
<string>
Blackburn Rovers F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Blackpool_F.C.
</uri>
<string>
Blackpool F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Botswana_Defence_Force_XI
</uri>
<string>
Botswana Defence Force XI
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Bolton_Wanderers_F.C.
</uri>
<string>
Bolton Wanderers F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Chelsea_F.C.
</uri>
<string>
Chelsea F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Everton_F.C.
</uri>
<string>
Everton F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Fulham_F.C.
</uri>
<string>
Fulham F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Harchester_United_F.C.
</uri>
<string>
Harchester United F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Liverpool_F.C.
</uri>
<string>
Liverpool F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Manchester_United_F.C.
</uri>
<string>
Manchester United F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Manchester_City_F.C.
</uri>
<string>
Manchester City F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Newcastle_United_F.C.
</uri>
<string>
Newcastle United F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Stoke_City_F.C.
</uri>
<string>
Stoke City F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Sunderland_A.F.C.
</uri>
<string>
Sunderland A.F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Tottenham_Hotspur_F.C.
</uri>
<string>
Tottenham Hotspur F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/West_Bromwich_Albion_F.C.
</uri>
<string>
West Bromwich Albion F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/West_Ham_United_F.C.
</uri>
<string>
West Ham United F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/Wolverhampton_Wanderers_F.C.
</uri>
<string>
Wolverhampton Wanderers F.C.
</string>
</answer>
<answer>
<uri>
http://dbpedia.org/resource/London_Dynamo
</uri>
<string>
London Dynamo
</string>
</answer>
</answers>
</question>
<question id="47">
<string>
Is Natalie Portman an actress?
</string>
<query>
PREFIX rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt;
PREFIX rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt;
PREFIX onto: &lt;http://dbpedia.org/ontology/&gt;
ASK
WHERE 
{ 
	?subject rdf:type onto:Actor.
      	?subject rdfs:label 'Natalie Portman'@en.
}
</query>
<answers>
<answer>
<boolean>
true
</boolean>
</answer>
</answers>
</question>
</dataset>
